## Exercise 24
The MySQL queries that are required are provided below:

In [ ]:
"""
CREATE DATABASE university;
"""
## SHOW DATABASES;

In [ ]:
"""
USE university
"""

### Create Tables (students, courses, enrollments)

In [ ]:
"""
CREATE TABLE students(
student_id INT NOT NULL AUTO_INCREMENT,
first_name VARCHAR(255) NOT NULL,
last_name VARCHAR(255) NOT NULL,
date_of_birth DATE,
email VARCHAR(255),
PRIMARY KEY (student_id)
);
"""
## SHOW TABLES;
## SHOW FIELDS FROM students;

In [ ]:
"""
CREATE TABLE courses(
course_id INT NOT NULL AUTO_INCREMENT,
course_name VARCHAR(255) NOT NULL,
instructor VARCHAR(255),
PRIMARY KEY (course_id)
);
"""
## SHOW TABLES;
## SHOW FIELDS FROM courses;

In [ ]:
"""
CREATE TABLE enrollments(
enrollment_id INT NOT NULL AUTO_INCREMENT,
student_id INT NOT NULL,
course_id INT NOT NULL,
enrollment_date DATE,
PRIMARY KEY (enrollment_id),
FOREIGN KEY (student_id) REFERENCES students (student_id),
FOREIGN KEY (course_id) REFERENCES courses (course_id)
);
"""
## SHOW TABLES;
## SHOW FIELDS FROM enrollments;

### 1. Data Insertion:

In [ ]:
## Data Insertion:
"""
INSERT INTO students (first_name, last_name, date_of_birth)
VALUES
('Koosha', 'Rahnama', '2002-04-23'),
('Maryam', 'Ahmadi', '1999-02-01'),
('Aida', 'Mohammadi', '1998-03-12'),
('Reza', 'Rad', '2000-07-15'),
('Mona', 'Hashemi', '2000-12-23'),
('Reza', 'Maleki', '1999-06-23'),
('Ali', 'Mirzaei', '2001-04-07');
"""
## SELECT * FROM students;

"""
INSERT INTO courses (course_name, instructor)
VALUES
('Introduction to Java', 'Bakhshandeh'),
('Data Structure', 'Hadian'),
('DataBase', 'Basiri'),
('Adavnced Java', 'Bakhshandeh');
"""
## SELECT * FROM courses;

"""
INSERT INTO enrollments (student_id, course_id, enrollment_date)
VALUES
(1, 2, NOW()),
(1, 3, NOW()),
(1, 4, NOW()),
(2, 1, NOW()),
(2, 2, NOW()),
(3, 1, NOW()),
(3, 2, NOW()),
(5, 3, NOW()),
(6, 1, NOW()),
(6, 2, NOW()),
(7, 2, NOW()),
(7, 3, NOW()),
(7, 4, NOW());
"""
## SELECT * FROM enrollments;

### 2. Querying Student Enrollments:

In [ ]:
## 2. Querying Student Enrollments:
"""
SELECT first_name, last_name, COUNT(enrollment_id) AS number_of_enrolls FROM students 
LEFT JOIN enrollments
ON students.student_id = enrollments.student_id
GROUP BY students.student_id;
"""

### 3. Data Removal:
In order to address this problem and mitigate potential errors, we employed three queries. Initially, we stored the `student_id` of students who either enrolled in a course or had no enrollments in a temporary table named `temp_students`. Subsequently, to eliminate dependencies between the `students` and `enrollments` tables, we removed the enrollments from the `enrollments` table that had a corresponding `student_id` in the `temp_students` table. Finally, we removed the students from the `students` table whose IDs were present in the `temp_students` table.

In [ ]:
## 3. Data Removal
"""
CREATE TEMPORARY TABLE temp_students AS
SELECT students.student_id
FROM students
LEFT JOIN enrollments ON students.student_id = enrollments.student_id
GROUP BY students.student_id
HAVING COUNT(enrollments.enrollment_id) < 2;

DELETE FROM enrollments
WHERE student_id IN (
    SELECT student_id
    FROM temp_students
);

DELETE FROM students
WHERE student_id IN (
    SELECT student_id
    FROM temp_students
);
"""

### 4. Updating Course Names

In [ ]:
## 4. Updating Course Names

"""
UPDATE courses
SET course_name = 'Python'
WHERE course_name LIKE '%JAVA%';
"""
## SELECT * FROM courses;

## Exercise 25
Write question 24 by mysql.connector library.

In [1]:
## import Library:
import mysql.connector
from mysql.connector import Error 

## Connecting to MySQL:
mydb = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "pass"
)

## Create a cursor:
mycursor = mydb.cursor()

## Create database:
sql = "Create DATABASE university"
try:
    mycursor.execute(sql)
except Error as e:
    print(e)

## Ensure the database has been created:
sql = "SHOW DATABASES;"
try: 
    mycursor.execute(sql)
except Error as e:
    print(e)
mycursor.fetchall() # returns a list of 1-tuples

[('db1',),
 ('information_schema',),
 ('mysql',),
 ('onlineshop',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('university',),
 ('world',)]

In [2]:
## Connecting to a specific database:
try:
    mydb = mysql.connector.connect(
        host = "localhost",
        user = "root",
        password = "pass",
        database = "university"
    )
except Error as e:
    print(e)
    
## Create a cursor:
mycursor = mydb.cursor()

### Create Tables (students, courses, enrollments)

In [3]:
sql = """
        CREATE TABLE students(
        student_id INT NOT NULL AUTO_INCREMENT,
        first_name VARCHAR(255) NOT NULL,
        last_name VARCHAR(255) NOT NULL,
        date_of_birth DATE,
        email VARCHAR(255),
        PRIMARY KEY (student_id)
        );
"""
try: 
    mycursor.execute(sql)
except Error as e:
    print(e)

sql = "SHOW TABLES;"
try:
    mycursor.execute(sql)
except Error as e:
    print(e)
mycursor.fetchall() # returns a list of 1-tuples

[('students',)]

In [4]:
sql = """
        CREATE TABLE courses(
        course_id INT NOT NULL AUTO_INCREMENT,
        course_name VARCHAR(255) NOT NULL,
        instructor VARCHAR(255),
        PRIMARY KEY (course_id)
        );
"""

try: 
    mycursor.execute(sql)
except Error as e:
    print(e)

sql = "SHOW TABLES;"
try:
    mycursor.execute(sql)
except Error as e:
    print(e)
mycursor.fetchall() # returns a list of 1-tuples

[('courses',), ('students',)]

In [5]:
sql = """
        CREATE TABLE enrollments(
        enrollment_id INT NOT NULL AUTO_INCREMENT,
        student_id INT NOT NULL,
        course_id INT NOT NULL,
        enrollment_date DATE,
        PRIMARY KEY (enrollment_id),
        FOREIGN KEY (student_id) REFERENCES students (student_id),
        FOREIGN KEY (course_id) REFERENCES courses (course_id)
);
"""

try: 
    mycursor.execute(sql)
except Error as e:
    print(e)

sql = "SHOW TABLES;"
try:
    mycursor.execute(sql)
except Error as e:
    print(e)
mycursor.fetchall() # returns a list of 1-tuples

[('courses',), ('enrollments',), ('students',)]

### 1. Data Insertion:

In [6]:
sql = """
        INSERT INTO students (first_name, last_name, date_of_birth)
        VALUES
        ('Koosha', 'Rahnama', '2002-04-23'),
        ('Maryam', 'Ahmadi', '1999-02-01'),
        ('Aida', 'Mohammadi', '1998-03-12'),
        ('Reza', 'Rad', '2000-07-15'),
        ('Mona', 'Hashemi', '2000-12-23'),
        ('Reza', 'Maleki', '1999-06-23'),
        ('Ali', 'Mirzaei', '2001-04-07');
"""
try: 
    mycursor.execute(sql)
    mydb.commit()
except Error as e:
    print(e)

sql = "SELECT * FROM students"
try:
    mycursor.execute(sql)
except Error as e:
    print(e)
mycursor.fetchall() # returns a list of tuples

[(1, 'Koosha', 'Rahnama', datetime.date(2002, 4, 23), None),
 (2, 'Maryam', 'Ahmadi', datetime.date(1999, 2, 1), None),
 (3, 'Aida', 'Mohammadi', datetime.date(1998, 3, 12), None),
 (4, 'Reza', 'Rad', datetime.date(2000, 7, 15), None),
 (5, 'Mona', 'Hashemi', datetime.date(2000, 12, 23), None),
 (6, 'Reza', 'Maleki', datetime.date(1999, 6, 23), None),
 (7, 'Ali', 'Mirzaei', datetime.date(2001, 4, 7), None)]

In [7]:
sql = """
        INSERT INTO courses (course_name, instructor)
        VALUES
        ('Introduction to Java', 'Bakhshandeh'),
        ('Data Structure', 'Hadian'),
        ('DataBase', 'Basiri'),
        ('Adavnced Java', 'Bakhshandeh');
"""
try: 
    mycursor.execute(sql)
    mydb.commit()
except Error as e:
    print(e)

sql = "SELECT * FROM courses"
try:
    mycursor.execute(sql)
except Error as e:
    print(e)

mycursor.fetchall() # returns a list of tuples

[(1, 'Introduction to Java', 'Bakhshandeh'),
 (2, 'Data Structure', 'Hadian'),
 (3, 'DataBase', 'Basiri'),
 (4, 'Adavnced Java', 'Bakhshandeh')]

In [8]:
sql = """
        INSERT INTO enrollments (student_id, course_id, enrollment_date)
        VALUES
        (1, 2, NOW()),
        (1, 3, NOW()),
        (1, 4, NOW()),
        (2, 1, NOW()),
        (2, 2, NOW()),
        (3, 1, NOW()),
        (3, 2, NOW()),
        (5, 3, NOW()),
        (6, 1, NOW()),
        (6, 2, NOW()),
        (7, 2, NOW()),
        (7, 3, NOW()),
        (7, 4, NOW());
"""
try: 
    mycursor.execute(sql)
    mydb.commit()
except Error as e:
    print(e)

sql = "SELECT * FROM enrollments"
try:
    mycursor.execute(sql)
except Error as e:
    print(e)
mycursor.fetchall()

[(1, 1, 2, datetime.date(2024, 1, 10)),
 (2, 1, 3, datetime.date(2024, 1, 10)),
 (3, 1, 4, datetime.date(2024, 1, 10)),
 (4, 2, 1, datetime.date(2024, 1, 10)),
 (5, 2, 2, datetime.date(2024, 1, 10)),
 (6, 3, 1, datetime.date(2024, 1, 10)),
 (7, 3, 2, datetime.date(2024, 1, 10)),
 (8, 5, 3, datetime.date(2024, 1, 10)),
 (9, 6, 1, datetime.date(2024, 1, 10)),
 (10, 6, 2, datetime.date(2024, 1, 10)),
 (11, 7, 2, datetime.date(2024, 1, 10)),
 (12, 7, 3, datetime.date(2024, 1, 10)),
 (13, 7, 4, datetime.date(2024, 1, 10))]

### 2. Querying Student Enrollments:

In [9]:
sql = """
        SELECT first_name, last_name, COUNT(enrollment_id) AS number_of_enrolls FROM students 
        LEFT JOIN enrollments
        ON students.student_id = enrollments.student_id
        GROUP BY students.student_id;
"""
try: 
    mycursor.execute(sql)
except Error as e:
    print(e)
mycursor.fetchall()

[('Koosha', 'Rahnama', 3),
 ('Maryam', 'Ahmadi', 2),
 ('Aida', 'Mohammadi', 2),
 ('Reza', 'Rad', 0),
 ('Mona', 'Hashemi', 1),
 ('Reza', 'Maleki', 2),
 ('Ali', 'Mirzaei', 3)]

### 3. Data Removal:

In [10]:
sql = """
        CREATE TEMPORARY TABLE temp_students AS
        SELECT students.student_id
        FROM students
        LEFT JOIN enrollments ON students.student_id = enrollments.student_id
        GROUP BY students.student_id
        HAVING COUNT(enrollments.enrollment_id) < 2;
"""
try: 
    mycursor.execute(sql)
except Error as e:
    print(e)

sql = """
        DELETE FROM enrollments
        WHERE student_id IN (
            SELECT student_id
            FROM temp_students
        );
"""
try: 
    mycursor.execute(sql)
    mydb.commit()
except Error as e:
    print(e)

sql = """
        DELETE FROM students
        WHERE student_id IN (
            SELECT student_id
            FROM temp_students
        );
"""
try: 
    mycursor.execute(sql)
    mydb.commit()
except Error as e:
    print(e)

## Show results:
sql = "SELECT * FROM enrollments"
try:
    mycursor.execute(sql)
except Error as e:
    print(e)
mycursor.fetchall()

sql = "SELECT * FROM students"
try:
    mycursor.execute(sql)
except Error as e:
    print(e)
mycursor.fetchall()

[(1, 'Koosha', 'Rahnama', datetime.date(2002, 4, 23), None),
 (2, 'Maryam', 'Ahmadi', datetime.date(1999, 2, 1), None),
 (3, 'Aida', 'Mohammadi', datetime.date(1998, 3, 12), None),
 (6, 'Reza', 'Maleki', datetime.date(1999, 6, 23), None),
 (7, 'Ali', 'Mirzaei', datetime.date(2001, 4, 7), None)]

### 4. Updating Course Names:

In [11]:
sql = """
        UPDATE courses
        SET course_name = 'Python'
        WHERE course_name LIKE '%JAVA%';
"""
try: 
    mycursor.execute(sql)
    mydb.commit()
except Error as e:
    print(e)

sql = "SELECT * FROM courses"
try:
    mycursor.execute(sql)
except Error as e:
    print(e)
mycursor.fetchall()

[(1, 'Python', 'Bakhshandeh'),
 (2, 'Data Structure', 'Hadian'),
 (3, 'DataBase', 'Basiri'),
 (4, 'Python', 'Bakhshandeh')]